[
  {
    "name": "Kettlebell Windmill",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The single-kettlebell windmill is a dynamic kettlebell exercise emphasizing core strength and shoulder and hip mobility and stability. It is often used as a functional warm-up or for multi-directional strength work. It doesn't work as well in a metcon or conditioning setting, and shouldn't be performed under intense fatigue.",
    "body_part": "Abdominals",
    "equipment": "Kettlebells",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0554.gif"
  },
  {
    "name": "Kettlebell swing",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The kettlebell swing is a popular lower-body exercise emphasizing the hamstrings, glutes, and back muscles. It is often used to train explosive power, for aerobic or cardiovascular conditioning, in circuit training, or as an accessory movement for the deadlift.",
    "body_part": "Abdominals",
    "equipment": "Kettlebells",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0549.gif"
  },
  {
    "name": "Dumbbell side bend",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The dumbbell side bend is a popular exercise for targeting the oblique muscles of the abdomen. It is usually performed for relatively high reps, at least 8-12 reps per set or more. It can be performed one side at a time or alternating sides.",
    "body_part": "Abdominals",
    "equipment": "Dumbbell",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0407.gif"
  },
  {
    "name": "Barbell press sit-up",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The barbell press sit-up is a weighted exercise focusing on the abdominal muscles, as well as the shoulders to a lesser degree. It primarily targets the rectus abdominis or \"six-pack\" muscles, but also involves the obliques and deep core muscles. It can be performed on the floor with the feet anchored or unanchored, or on a decline or other bench. It is similar to the Otis-up, which is performed with a weight plate.",
    "body_part": "Abdominals",
    "equipment": "Other",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0071.gif"
  },
  {
    "name": "Cable reverse crunch",
    "type": "Strength",
    "level": "Beginner",
    "description": "The cable reverse crunch is performed on the ground facing away from a high pulley, which helps target the lower abdominals specifically.",
    "body_part": "Abdominals",
    "equipment": "Cable",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0873.gif"
  },
  {
    "name": "Cocoons",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The cocoon crunch is a bodyweight exercise targeting the ab muscles, the rectus abdominis or \"six-pack\" muscles in particular. It involves bringing your knees to your chest and your arms from overhead to center. It can be performed for time or reps as part of the ab-focused portion of any workout.",
    "body_part": "Abdominals",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0260.gif"
  },
  {
    "name": "Decline Crunch",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The decline crunch is an effective core exercise targeting the rectus abdominis.",
    "body_part": "Abdominals",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0277.gif"
  },
  {
    "name": "Hanging Oblique Knee Raise",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The hanging oblique crunch an abdominal exercise that targets both the rectus abdominus or “six-pack” muscles, and the oblique muscles. It can be performed hanging from a bar, or if grip strength is a limitation, by placing the elbows in ab straps. If hanging from a straight bar is uncomfortable to the wrists or shoulder, you can also perform them hanging with a neutral grip (palms facing one another)",
    "body_part": "Abdominals",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/1761.gif"
  },
  {
    "name": "Hanging leg raise",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The hanging leg raise is an exercise targeting the abs, but which also works the lats and hip flexors. Instead of resting your forearms on the pads of a captain's chair, you perform these hanging from a bar. Experienced lifters make these look easy, but beginners may need time to build up to sets of 8-12 reps.",
    "body_part": "Abdominals",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0472.gif"
  },
  {
    "name": "Mountain climber",
    "type": "Plyometrics",
    "level": "Intermediate",
    "description": "The mountain climber is a popular bodyweight exercise targeting the muscles of the core, as well as the shoulders, hips, and cardiovascular system. It involves lifting one knee to the chest at a time from a straight-arm plank position. It can be performed for time or reps as part of a dynamic warm-up, for bodyweight cardio or conditioning, or as no-equipment dynamic core training.",
    "body_part": "Abdominals",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0630.gif"
  },
  {
    "name": "3/4 sit-up",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The 3/4 sit-up is a bodyweight exercise focused on the muscles of the core. It is similar to a sit-up, but stops short of the top position. This keeps constant tension on the abs, making it more difficult than traditional sit-ups. It can be performed for time or for reps, with the feet anchored or free, as part of the ab-focused portion of any workout.",
    "body_part": "Abdominals",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0001.gif"
  },
  {
    "name": "Reverse crunch",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The reverse crunch is a popular exercise targeting the abdominals, particularly the lower half. It’s easy to perform on either the floor or a flat bench. Many lifters think of this as a companion to the crunch, which targets the upper abdominals more than the lower.",
    "body_part": "Abdominals",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0872.gif"
  },
  {
    "name": "Russian twist",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The Russian twist is an exercise targeting the abdominals and the obliques. Beginning from a position that resembles stopping midway through a sit-up, it involves twisting side to side. It can be performed with body weight alone or while holding a weight plate or other object. It is performed by alternating sides with each rep and can be done for time or for a specific number of reps as part of the ab-focused portion of any workout.",
    "body_part": "Abdominals",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0687.gif"
  },
  {
    "name": "Bear crawl",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The bear crawl is a popular bodyweight crawling exercise. While it looks simple, the bear crawl is an intense full-body movement that targets the cardiovascular system as well as a wide range of muscle groups, the shoulders, core, and legs in particular. It can be done as a full-body warm-up, in short bursts for power or circuit training, or for longer durations as cardiovascular conditioning.",
    "body_part": "Abdominals",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/3360.gif"
  },
  {
    "name": "Shoulder tap",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The shoulder tap is an exercise targeting the abdominals and core. The basic stance matches the top of a push-up position. From there, one hand is raised to tap its opposing shoulder. A tap with each hand to each opposing shoulder equals one rep.",
    "body_part": "Abdominals",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/3699.gif"
  },
  {
    "name": "Push-up to side plank",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The push-up to side plank is an upper-body and core-focused exercise combining two popular bodyweight movements. It targets the chest, triceps, and shoulders with the push-up, and the obliques and hip external rotator muscles with the side plank. It can be performed as part of a dynamic warm-up or any bodyweight strength-training workout.",
    "body_part": "Abdominals",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0664.gif"
  },
  {
    "name": "Decline sit-up",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The decline sit-up is a bodyweight core exercise that works the rectus abdominis or \"six pack\" muscles. Sit-up variations are usually performed for moderate to high reps, such as 10-15 reps per set or more, as part of the core-focused portion of a workout.",
    "body_part": "Abdominals",
    "equipment": "None",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0282.gif"
  },
  {
    "name": "Barbell Curl",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The barbell curl is an arm exercise that is also one of the most recognizable movements in all of bodybuilding and fitness. It helps build sleeve-popping biceps and allows heavier loading than many other curl variations. It is usually performed in moderate to high reps, such as 8-12 reps per set, as part of the arm-focused portion of any workout.",
    "body_part": "Biceps",
    "equipment": "Barbell",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0031.gif"
  },
  {
    "name": "Dumbbell preacher curl",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The dumbbell preacher curl is an exercise that focuses on building the biceps, particularly the biceps peak. All you need is a pair of dumbbells and a preacher bench. It's usually performed for moderate to high reps as part of an upper-body or arms-focused workout.",
    "body_part": "Biceps",
    "equipment": "Dumbbell",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0372.gif"
  },
  {
    "name": "Dumbbell biceps curl",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The dumbbell biceps curl is a single-joint exercise for building bigger and stronger biceps. Popular among gym goers of all experience levels, this move can be done seated or standing. It is generally performed for moderate to high reps, such as 8-12 reps or higher, as part of the arm-focused portion of a workout.",
    "body_part": "Biceps",
    "equipment": "Dumbbell",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0294.gif"
  },
  {
    "name": "Weighted donkey calf raise",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The weighted donkey calk raise is a strength and muscle-building exercise focused on the muscles of the lower leg, most prominently the gastrocnemius muscle. While traditional donkey calf raises involved either a specific machine or carrying another person on one's back, this method uses a weight belt. It can be done in traditional muscle-building rep ranges, or for higher reps as part of lower-body training.",
    "body_part": "Calves",
    "equipment": "Other",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0833.gif"
  },
  {
    "name": "Kettlebell plyo push-up",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The kettlebell plyo push-up is an explosive upper-body movement that uses a kettlebell primarily as a platform for the hands. A short step, dumbbell, or other stationary object could also be used in place of the kettlebell. It can be performed for reps or time, either for low reps to build explosive power or for higher reps for conditioning.",
    "body_part": "Chest",
    "equipment": "Kettlebells",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0545.gif"
  },
  {
    "name": "Incline Push-Up",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The hands-elevated push-up is a variation on the push-up, a body-weight standard. The hands are elevated, so that your body is aligned at an angle to the floor rather than parallel.",
    "body_part": "Chest",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0493.gif"
  },
  {
    "name": "Decline Push-Up",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The feet-elevated push-up is a variation on the push-up, a body-weight standard. The feet are elevated, so that your body is aligned at an angle to the floor rather than parallel.",
    "body_part": "Chest",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0279.gif"
  },
  {
    "name": "Isometric Wipers",
    "type": "Strength",
    "level": "Beginner",
    "description": "The typewriter push-up is an advanced push-up variation where the hands are extra wide and you lower toward each hand in alternating reps. It is more challenging to each working arm than traditional push-ups and also stretches and challenges the chest.",
    "body_part": "Chest",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0500.gif"
  },
  {
    "name": "Clock push-up",
    "type": "Strength",
    "level": "Beginner",
    "description": "The clock push-up is a series of regular push-ups performed one at a time, moving your hands one step to the side between each one until you've completed a full circle. It targets the same muscles as traditional push-ups, such as the chest, triceps, and shoulders, but adds an endurance and core challenge to traditional push-ups.",
    "body_part": "Chest",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0258.gif"
  },
  {
    "name": "Suspended push-up",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The suspended push-up is a bodyweight pushing exercise performed on a suspension strap system or gymnastic rings. It targets the chest, shoulders, and triceps, but is also challenging to the core and upper back. It can work in traditional strength and muscle-building rep ranges or for higher reps.",
    "body_part": "Chest",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0806.gif"
  },
  {
    "name": "Diamond push-up",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The diamond push-up is an advanced variation of the push-up exercise performed with the hands in a diamond shape. It increases the challenge to the triceps, but also targets the chest and shoulders.",
    "body_part": "Chest",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0283.gif"
  },
  {
    "name": "Push-up",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The push-up is a popular bodyweight exercise that is commonly used in military and tactical physical fitness tests. It’s a classic movement to build upper-body muscle and strength, emphasizing the chest, triceps, and shoulders, but also working the upper back and core.",
    "body_part": "Chest",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0662.gif"
  },
  {
    "name": "Medicine Ball Chest Pass",
    "type": "Plyometrics",
    "level": "Intermediate",
    "description": "The medicine ball pass is a simple partner-based exercise that involves throwing a weighted ball back-and-forth. It can be part of a dynamic warm-up for lifting or athletics, but can also work as active rest or as a component of circuit training.",
    "body_part": "Chest",
    "equipment": "Medicine Ball",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/1302.gif"
  },
  {
    "name": "Dumbbell Bench Press",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The dumbbell bench press is a mainstay of workout enthusiasts worldwide. It’s a classic move for building a bigger, stronger chest. As such, it’s often placed first in mass-building chest workouts.",
    "body_part": "Chest",
    "equipment": "Dumbbell",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0289.gif"
  },
  {
    "name": "Chest dip",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The chest dip is a bodyweight exercise performed on parallel bars or on a pull-up and dip station. It targets the chest, triceps, and shoulders. Dips with a chest focus are usually performed with the torso leaning forward and the elbows angled out from the torso. Dips can be performed for low reps for strength or higher reps for muscle growth.",
    "body_part": "Chest",
    "equipment": "Other",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0251.gif"
  },
  {
    "name": "Barbell glute bridge",
    "type": "Powerlifting",
    "level": "Intermediate",
    "description": "The barbell glute bridge is a popular exercise targeting the muscles of the glutes and hamstrings. It can be done as a strength movement on its own, as an activation drill or warm-up for lower-body training, or as a burnout at the end of a lower-body workout.",
    "body_part": "Glutes",
    "equipment": "Barbell",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/1409.gif"
  },
  {
    "name": "Kettlebell thruster",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The kettlebell thruster is a popular kettlebell movement that combines a kettlebell front squat with a kettlebell press, while holding the bell in a goblet or bottoms-up grip. It is preceded by a clean at the start of each set, and you can perform a clean between each rep if you choose. It can be trained in traditional strength or muscle-building rep ranges, in circuit or fat-loss training, or as part of a larger kettlebell combination or complex.",
    "body_part": "Glutes",
    "equipment": "Kettlebells",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0550.gif"
  },
  {
    "name": "Walking lunge",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The walking lunge is a lower-body exercise that targets the glutes, quads, and hamstrings while challenging stability and balance. It can be performed for reps, time, or distance in the lower-body portion of any workout.",
    "body_part": "Glutes",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/1460.gif"
  },
  {
    "name": "Barbell Deadlift",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The barbell deadlift is a compound exercise used to develop overall strength and size in the posterior chain. It is a competition lift in the sport of powerlifting, but is also considered a classic benchmark of overall strength. When performed with the hands outside the knees, it is often called a \"conventional\" deadlift. When the feet are wide and the hands are inside the knees, it is a sumo deadlift.",
    "body_part": "Hamstrings",
    "equipment": "Barbell",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0032.gif"
  },
  {
    "name": "Power clean",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The power clean is a full-body movement in which the bar is pulled from the floor and caught in the front rack position in three pulls or phases. The bar is received in the \"power\" position, with the hips higher than a full-depth squat position. The power clean can be used as a component of the clean and press or clean and jerk, but is also a valuable lift to build explosive power and strength.",
    "body_part": "Hamstrings",
    "equipment": "Barbell",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0648.gif"
  },
  {
    "name": "Inchworm",
    "type": "Stretching",
    "level": "Beginner",
    "description": "The inchworm is a popular bodyweight exercise that involves “walking” the hands on the floor from a bent-over toe-touch position into a straight-arm plank. It is usually performed as part of a dynamic warm-up to help raise core body temperature and “limber up” the body from head to toe.",
    "body_part": "Hamstrings",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/1471.gif"
  },
  {
    "name": "Weighted pull-up",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The weighted pull-up is a more advanced variation of the pull-up exercise in which the lifter adds extra weight to their body. Options for adding weight include a dip belt, weighted vest, chains, a dumbbell placed between the feet or legs, or looping a kettlebell over the foot. Like other pull-up variations, the weighted pull-up builds strength and muscle in the upper back, biceps, and core.",
    "body_part": "Lats",
    "equipment": "Other",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0841.gif"
  },
  {
    "name": "Pull-up",
    "type": "Strength",
    "level": "Beginner",
    "description": "The pull-up is a multijoint bodyweight exercise that builds strength and muscle in the upper back, biceps, and core. It is often used as a measurement tool in military or tactical fitness tests, and is an excellent gauge of \"relative strength\" which is strength in relation to body weight.",
    "body_part": "Lats",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0652.gif"
  },
  {
    "name": "Rope climb",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The rope climb is an exercise that is used commonly in CrossFit workouts and as a test of upper-body strength. It was even contested at the Olympics in the early 20th century. It targets a wide range of upper-body musculature, including the hands and forearms, shoulders, biceps, lats (latissimus dorsi), and core.",
    "body_part": "Lats",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0680.gif"
  },
  {
    "name": "Chin-Up",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The a chin-up is a variation of the pull-up exercise in which the reps are performed with the palms facing toward the body, in an underhand position, with a grip that is narrower than shoulder-width. Like other pull-up variations, it builds strength and muscle in the upper back, biceps, and core, but it utilizes the biceps slightly more than overhand pull-ups. It can be used as a more shoulder-friendly alternative to straight-bar pull-ups, or to help perform more reps than you can perform overhand.",
    "body_part": "Lats",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/1326.gif"
  },
  {
    "name": "Iron cross stretch",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The iron cross stretch is a bodyweight stretch that focuses on hip and thoracic spine mobility.",
    "body_part": "Lats",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/1419.gif"
  },
  {
    "name": "Barbell good morning",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The barbell good morning is an exercise that targets glute, hamstring, and lower back development. It is often trained as an accessory movement to the deadlift, but also has value on its own. It is sometimes performed for reps in traditional strength-focused rep ranges such as 5-8 reps per set, but due to the risk posed to the lower back, is rarely treated as a max-effort single-rep lift.",
    "body_part": "Lower Back",
    "equipment": "Barbell",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0044.gif"
  },
  {
    "name": "Kettlebell alternating renegade row",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The kettlebell alternating renegade row combines rowing and core training into a single difficult movement. It's popular in time-efficient strength and muscle-building workouts, as well as in circuit-style training.",
    "body_part": "Middle Back",
    "equipment": "Kettlebells",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0521.gif"
  },
  {
    "name": "Suspended row",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The suspended row is a bodyweight pulling exercise that focuses on the muscles of the middle and upper back, as well as the biceps. It can be trained in traditional muscle-building rep ranges or for higher reps. It can also work as part of a dynamic warm-up for a pressing or pulling-focused workout.",
    "body_part": "Middle Back",
    "equipment": "Other",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0808.gif"
  },
  {
    "name": "Barbell shrug",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The barbell shrug is an exercise targeting the traps (trapezius muscles). It is popular in strength and muscle-focused upper-body training, and is often trained on a shoulder day. With the assistance of straps, it can be loaded heavily, but it is still usually performed for moderate to high reps, such as 8-10 reps per set.",
    "body_part": "Traps",
    "equipment": "Barbell",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0095.gif"
  },
  {
    "name": "Cable shrug",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The cable shrug is an exercise targeting the traps, as well as hitting the shoulders and upper back. Cables allow for lighter loading which is beneficial for higher-rep sets.",
    "body_part": "Traps",
    "equipment": "Cable",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0220.gif"
  },
  {
    "name": "Barbell Full Squat",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The barbell back squat is a popular compound movement that emphasizes building the lower-body muscle groups and overall strength. It's the classic way to start a leg day, and is a worthy centerpiece to a lower-body training program. The squat is a competitive lift in the sport of powerlifting, but is also a classic measurement of lower-body strength. With the barbell racked on the traps or upper back, the emphasis is placed on the posterior chain but the entire body gets worked. The back squat can be trained in everything from heavy singles to sets of 20 reps or higher.",
    "body_part": "Quadriceps",
    "equipment": "Barbell",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0043.gif"
  },
  {
    "name": "Barbell front squat",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The barbell front squat is a compound movement that emphasizes building the lower-body muscle groups. With the barbell racked in front of the body on the anterior delts, the front squat emphasizes the quads and glutes, but also upper back and core strength to remain upright. Front squats can be trained as an alternative to back squats, as an accessory movement for either squats or deadlifts, or for strength and muscle on their own. Many lifters and athletes prefer them to back squats, although they can be uncomfortable and difficult to learn at first.",
    "body_part": "Quadriceps",
    "equipment": "Barbell",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0042.gif"
  },
  {
    "name": "Barbell step-up",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The barbell step-up is a great exercise for building lower-body strength and power. It targets all the same muscles as bodyweight step-ups, such as the quads, glutes, and hamstrings, but allows for greater muscular overload.",
    "body_part": "Quadriceps",
    "equipment": "Barbell",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0114.gif"
  },
  {
    "name": "Barbell hack squat",
    "type": "Strength",
    "level": "Expert",
    "description": "The barbell hack squat is a variety of deadlift performed with the barbell behind the legs. This forces the lifter into a body position similar to a squat and targets the quads and glutes. It is named after famed strongman George Hackenschmidt, who performed it as an overall leg-building exercise. The barbell hack squat can be used as a substitute for the machine hack squat, or as a lower-body strength and size movement on its own.",
    "body_part": "Quadriceps",
    "equipment": "Barbell",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0046.gif"
  },
  {
    "name": "Barbell thruster",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The barbell thruster is a full-body exercise that incorporates both squatting and pressing in one functional movement. It's especially common in contemporary CrossFit workouts, but also in general strength training. The barbell is usually cleaned into place first, but it could be performed taken from a squat rack in a front-rack position. The thruster can be performed in traditional strength-focused rep ranges to build strength in the press, or in higher reps for full-body conditioning.",
    "body_part": "Quadriceps",
    "equipment": "Barbell",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/3305.gif"
  },
  {
    "name": "Barbell side split squat",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The barbell side split squat is a variation of the split squat that targets the lower body, specifically the quads, and requires good hip mobility.",
    "body_part": "Quadriceps",
    "equipment": "Barbell",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0098.gif"
  },
  {
    "name": "Barbell speed squat",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The barbell speed squat targets the lower-body muscle groups using lighter weights to perform fast-paced back squats. Speed squats are popular in certain powerlifting training methodologies as a way to engrain form and lifting speed that can carry over to max-effort lifts. In this approach, they are usually performed in numerous sets of 3-5 reps with adequate rest in between. Speed squats are also sometimes performed with bands or chains adding extra resistance to the top half of the lift.",
    "body_part": "Quadriceps",
    "equipment": "Barbell",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0101.gif"
  },
  {
    "name": "Dumbbell Goblet Squat",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The goblet squat is a common exercise used in the early stages of learning to squat, or as a movement in general training programs for building size to the quads, glutes, and hamstrings.",
    "body_part": "Quadriceps",
    "equipment": "Dumbbell",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/1760.gif"
  },
  {
    "name": "Dumbbell squat",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The dumbbell squat is a classic lower-body exercise that targets the quadriceps, hamstrings, and glutes. While this variation is usually performed with relatively light weights for high reps, it can also be used as a substitute for squats or the trap-bar deadlift in any workout.",
    "body_part": "Quadriceps",
    "equipment": "Dumbbell",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0413.gif"
  },
  {
    "name": "Dumbbell step-up",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The dumbbell step-up is a great exercise for building lower-body strength and power. It targets all the same muscles as bodyweight step-ups, such as the quads, glutes, and hamstrings, but allows for greater muscular overload.",
    "body_part": "Quadriceps",
    "equipment": "Dumbbell",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0431.gif"
  },
  {
    "name": "Dumbbell deadlift",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The dumbbell deadlift is a movement that targets the hamstrings, glutes, and back muscles. While it can be performed all the way from the ground, in the style of a barbell deadlift, it is more often performed from the top down as a Romanian deadlift. The dumbbell deadlift can be performed in low rep ranges to build posterior strength, or for moderate to high reps to build muscle and endurance.",
    "body_part": "Quadriceps",
    "equipment": "Dumbbell",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0300.gif"
  },
  {
    "name": "Tire flip",
    "type": "Strongman",
    "level": "Intermediate",
    "description": "The tire flip is an exercise that works the entire body, starting from a deadlift position and ending with a giant tire being flipped over. Each flip moves the tire farther in one direction until a set has been completed. It can be performed for time or reps as part of a functional fitness or athleticism-focused workout.",
    "body_part": "Quadriceps",
    "equipment": "Other",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/2459.gif"
  },
  {
    "name": "Weighted sissy squat",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The weighted sissy squat is an exercise primarily targeting the quadriceps. In sissy squats, the knees travel over the toes, placing the quads under a fairly extreme stretch. They are usually performed for moderate to high reps as part of a lower-body training session.",
    "body_part": "Quadriceps",
    "equipment": "Other",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0851.gif"
  },
  {
    "name": "Dumbbell step-up",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The dumbbell step-up is a great exercise for building lower-body strength and power. It targets all the same muscles as bodyweight step-ups, such as the quads, glutes, and hamstrings, but allows for greater muscular overload.",
    "body_part": "Quadriceps",
    "equipment": "Dumbbell",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0431.gif"
  },
  {
    "name": "Suspended split squat",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The suspended split squat is a single-leg squat variation performed with the rear leg in a suspension strap system. This allows the rear leg to move slightly more naturally than it would be able to on a bench. The exercise targets the quads, hamstring, and glute muscles on the front leg, but also taxes and stretches the quads on the rear leg.",
    "body_part": "Quadriceps",
    "equipment": "Other",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0809.gif"
  },
  {
    "name": "Burpee",
    "type": "Cardio",
    "level": "Intermediate",
    "description": "The burpee is a high-intensity exercise that recruits the entire body to build strength and aerobic capacity. It is common in CrossFit workouts and group fitness classes, but can also be performed for time or reps in any fat-loss or athleticism-focused circuit or workout.",
    "body_part": "Quadriceps",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/1160.gif"
  },
  {
    "name": "Jump Squat",
    "type": "Plyometrics",
    "level": "Intermediate",
    "description": "The jump squat is an explosive bodyweight exercise targeting the quads, hamstrings, and glutes. It is also a serious cardiovascular challenge when done for reps. It can be performed as a power exercise to build jumping power, or in any fat-loss or athleticism-focused workout.",
    "body_part": "Quadriceps",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0514.gif"
  },
  {
    "name": "Sissy squat",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The sissy squat is a bodyweight squat variation that involves letting the knees travel far over the toes, placing an extreme stretch on the quads. This movement targets the quad muscles directly and can be performed in partial or full ranges of motion based on knee health and pain.",
    "body_part": "Quadriceps",
    "equipment": "None",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/1489.gif"
  },
  {
    "name": "Band shoulder press",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The band shoulder press is a deltoid exercise and an alternative to the classic dumbbell shoulder press. The dynamic tension of the band forces the core to stabilize the body and more closely matches the strength curve of the shoulder press. It can be performed in low reps, such as 5-8 reps per set, to build shoulder strength, or for higher reps to build muscle and for conditioning. It can work as the main focus of a shoulder day but is also popular as an accessory movement to the bench press or barbell military press.",
    "body_part": "Shoulders",
    "equipment": "Bands",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0997.gif"
  },
  {
    "name": "Barbell upright row",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The barbell upright row is a barbell exercise that builds stronger and bigger traps. Many lifters combine this move with either their back or shoulder workout since it involves both body parts.",
    "body_part": "Shoulders",
    "equipment": "Barbell",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0120.gif"
  },
  {
    "name": "Barbell front raise",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The barbell front raise is an upper-body isolation exercise that targets the shoulders. It is usually performed for moderate to high reps, such as 8-12 reps or higher, as part of the shoulder-focused part of any workout.",
    "body_part": "Shoulders",
    "equipment": "Barbell",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0041.gif"
  },
  {
    "name": "Dumbbell front raise",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The dumbbell front raise is a single-joint exercise targeting the shoulder muscles, particularly the front or anterior deltoids. It is usually performed for moderate to high reps, at least 8-12 reps per set, as part of an upper-body or shoulder-focused workout.",
    "body_part": "Shoulders",
    "equipment": "Dumbbell",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0310.gif"
  },
  {
    "name": "Dumbbell Lying Rear Lateral Raise",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The incline dumbbell reverse fly is an upper-body exercise targeting the posterior or rear deltoids, as well as the postural muscles of the upper back. Because it targets such small muscles, this exercise is usually performed with light weight for high reps, such as 10-15 reps per set or more.",
    "body_part": "Shoulders",
    "equipment": "Dumbbell",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0348.gif"
  },
  {
    "name": "Dumbbell lateral raise",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The dumbbell lateral raise is a shoulder exercise that targets the medial or middle head of the deltoid muscle. It's a staple strength-training move and is a great option for accessory work on upper-body training days. It is usually performed for moderate to high reps, at least 8-12 reps, as part of the upper-body or shoulder-focused portion of a workout.",
    "body_part": "Shoulders",
    "equipment": "Dumbbell",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0334.gif"
  },
  {
    "name": "Cable seated row",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The cable seated row is a popular exercise to train the muscles of the upper back, including the lats (latissimus dorsi), traps, rhomboids, and rear deltoids, using a cable stack. It also targets the biceps to a lesser degree. The cable row can work well in a variety of rep ranges but is most popular in muscle-building workouts or as an accessory movement for strength workouts.",
    "body_part": "Shoulders",
    "equipment": "Cable",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0861.gif"
  },
  {
    "name": "Handstand push-up",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The handstand push-up is an exercise targeting the shoulders, although other muscles assist in the completion of the reps. It is common in both CrossFit workouts and advanced bodyweight or calisthenics training. Given the degree of difficulty, beginners will need to progress to this move.",
    "body_part": "Shoulders",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0471.gif"
  },
  {
    "name": "Triceps dip",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The triceps dip is a bodyweight exercise performed on parallel bars or on a pull-up and dip station. It targets the triceps first, but also stretches and strengthens the chest and shoulders. Dips with a triceps focus are usually performed with an upright torso, the knees bent and crossed, and the arms close to the body. Dips can be performed for low reps for strength or higher reps for muscle growth.",
    "body_part": "Triceps",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0814.gif"
  },
  {
    "name": "Weighted bench dip",
    "type": "Strength",
    "level": "Intermediate",
    "description": "The weighted bench dip is a highly effective exercise for building the triceps. The resistance comes from a combination of body weight and added weight—usually a weight plate.",
    "body_part": "Triceps",
    "equipment": "Body Only",
    "gif_url": "http://d205bpvrqc9yn1.cloudfront.net/0830.gif"
  }
]